# 테트로미노

'''
1. 회전, 이동 포함 19가지 경우 하드코딩
2. 모든 경우를 브루트포스로 해결
'''
tetrominos = [
[(0,0), (0,1), (0,2), (0,3)],
[(0,0), (1,0), (2,0), (3,0)],
[(0,0), (0,1), (1,0), (1,1)],
[(0,0), (1,0), (2,0), (2,1)],
[(0,1), (1,1), (2,1), (2,0)],
[(0,0), (1,0), (2,0), (0,1)],
[(0,1), (1,1), (2,1), (0,0)],
[(0,0), (0,1), (0,2), (1,2)],
[(0,0), (0,1), (0,2), (1,0)],
[(1,0), (1,1), (1,2), (0,2)],
[(1,0), (1,1), (1,2), (0,0)],
[(0,0), (1,0), (1,1), (2,1)],
[(0,1), (1,1), (1,0), (2,0)],
[(0,1), (0,2), (1,0), (1,1)],
[(0,0), (0,1), (1,1), (1,2)],
[(0,0), (0,1), (0,2), (1,1)],
[(1,0), (1,1), (1,2), (0,1)],
[(0,0), (1,0), (2,0), (1,1)],
[(0,1), (1,1), (2,1), (1,0)]
]

import sys
input = sys.stdin.readline

n, m = map(int, input().split())
board = []
for _ in range(n):
    board.append(list(map(int, input().split())))

ans = 0

for i in range(n):
    for j in range(m):
        for tetromino in tetrominos:
            tmp_sum = 0
            for dr, dc in tetromino:
                nr = i + dr
                nc = j + dc
                if 0 <= nr < n and 0 <= nc < m:
                    tmp_sum += board[nr][nc]
                else:
                    tmp_sum = 0
                    break
            if tmp_sum > ans:
                ans = tmp_sum

print(ans)